uhnp/src/Catalogs/СохраненныеВерсииПлатежногоКалендаря/СохраненныеВерсииПлатежногоКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СохраненныеВерсииПлатежногоКалендаря</name>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтбораДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтбораДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиКомпоновки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоДнейОперативногоПланирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаОтображенияПросроченныхПлатежей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокОпераций</name>
    <attributes>
      <name>Активна</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторОперации</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидОперации</name>
      <type>
        <types>EnumRef.ВидыОперацийПлатежногоКалендаря</types>
      </type>
    </attributes>
    <attributes>
      <name>УточнениеОперации</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеОперации</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Оптимизация</name>
      <comment>Операция добавлена в ходе оптимизации календаря</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОрганизацияСписания</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ОрганизацияЗачисления</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>БанкСписания</name>
      <type>
        <types>DefinedType.Банк</types>
      </type>
    </attributes>
    <attributes>
      <name>БанкЗачисления</name>
      <type>
        <types>DefinedType.Банк</types>
      </type>
    </attributes>
    <attributes>
      <name>БанковскийСчетКассаСписания</name>
      <type>
        <types>DefinedType.БанковскийСчетКасса</types>
      </type>
    </attributes>
    <attributes>
      <name>БанковскийСчетКассаЗачисления</name>
      <type>
        <types>DefinedType.БанковскийСчетКасса</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСписания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗачисления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаСписания</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаЗачисления</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыплатыПроцентов</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДвиженияДенежныхСредств</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПлановыеКурсы</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатрицаВесовЛиквидности</name>
    <attributes>
      <name>Источник</name>
      <type>
        <types>EnumRef.ИсточникиДанныхПлатежногоКалендаря</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриходРасход</name>
      <type>
        <types>EnumRef.ВидыДвиженийПриходРасход</types>
      </type>
    </attributes>
    <attributes>
      <name>ГоризонтПланированияЛиквидности</name>
      <type>
        <types>EnumRef.ГоризонтыПланированияЛиквидности</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>DefinedType.ВесИсточникаДанныхПлатежногоКалендаря</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/InformationRegisters/ПредставлениеПлатежногоКалендаря/ПредставлениеПлатежногоКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПредставлениеПлатежногоКалендаря</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ИдентификаторОтменившейОперации</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>КрайняяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированныйБанковскийСчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникДанных</name>
    <type>
      <types>EnumRef.ИсточникиДанныхПлатежногоКалендаря</types>
    </type>
  </attributes>
  <attributes>
    <name>Оптимизация</name>
    <comment>Операция добавлена в ходе оптимизации календаря</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВерсияПлатежногоКалендаря</name>
    <type>
      <types>CatalogRef.СохраненныеВерсииПлатежногоКалендаря</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПулЛиквидности</name>
    <type>
      <types>CatalogRef.ПулыЛиквидности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Банк</name>
    <type>
      <types>DefinedType.Банк</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БанковскийСчетКасса</name>
    <type>
      <types>DefinedType.БанковскийСчетКасса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РазделПлатежногоКалендаря</name>
    <type>
      <types>EnumRef.РазделыПлатежногоКалендаря</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Инструмент</name>
    <type>
      <types>DefinedType.ИнструментыПлатежногоКалендаря</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.ПриоритетыПлатежей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЗаписи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторДобавившейОперации</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДенежныхСредств</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/СохраненныеВерсииПлатежногоКалендаря/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ПутьКСпискуОпераций = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "СписокОпераций");
		Если ЭтоАдресВременногоХранилища(ПутьКСпискуОпераций) Тогда
			
			СохраненныеОперации = ПолучитьИзВременногоХранилища(ПутьКСпискуОпераций);
			Для Каждого ТекСтр Из СохраненныеОперации Цикл
				
				НоваяСтрока = СписокОпераций.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтр);
				НоваяСтрока.УточнениеОперации = Новый ХранилищеЗначения(ТекСтр.УточнениеОперации);
			КонецЦикла;
			
		КонецЕсли;
		
		ПутьКПлановымКурсам = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "ПлановыеКурсы");
		Если ЭтоАдресВременногоХранилища(ПутьКПлановымКурсам) Тогда
			ПлановыеКурсы.Загрузить(ПолучитьИзВременногоХранилища(ПутьКПлановымКурсам));
		КонецЕсли;
		
		ПутьКМатрицеВесов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "МатрицаВесовЛиквидности");
		Если ЭтоАдресВременногоХранилища(ПутьКМатрицеВесов)  Тогда
			МатрицаВесовЛиквидности.Загрузить(ПолучитьИзВременногоХранилища(ПутьКМатрицеВесов));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Наименование) Тогда
		Справочники.СохраненныеВерсииПлатежногоКалендаря.УстановитьНаименованиеАвтоматически(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПометкаУдаления Тогда
		
		НаборЗаписейИсходный = РегистрыСведений.ПредставлениеПлатежногоКалендаря.СоздатьНаборЗаписей();
		НаборЗаписейИсходный.Отбор.ВерсияПлатежногоКалендаря.Установить(Справочники.СохраненныеВерсииПлатежногоКалендаря.ПустаяСсылка());
		НаборЗаписейИсходный.Отбор.Пользователь.Установить(Ответственный);
		НаборЗаписейИсходный.Прочитать();
		
		НаборЗаписейРезультат = РегистрыСведений.ПредставлениеПлатежногоКалендаря.СоздатьНаборЗаписей();
		НаборЗаписейРезультат.Отбор.ВерсияПлатежногоКалендаря.Установить(Ссылка);
		НаборЗаписейРезультат.Отбор.Пользователь.Установить(Ответственный);
		Для Каждого ТекЗапись Из НаборЗаписейИсходный Цикл
			НоваяЗапись = НаборЗаписейРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекЗапись);
			НоваяЗапись.ВерсияПлатежногоКалендаря = Ссылка;
		КонецЦикла;
		
		НаборЗаписейРезультат.Записать();
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти

#КонецЕсли
